﻿﻿﻿//***********************************************************************
//*                                                                     *
//*   Copyright (c) 1985-2019, American Megatrends International LLC.   *
//*                                                                     *
//*      All rights reserved. Subject to AMI licensing agreement.       *
//*                                                                     *
//***********************************************************************
//<AMI_FHDR_START>
//
// Name:  <Ast2600Setup.uni>
//
// Description: SIO form string definitions.
//
//<AMI_FHDR_END>
//**********************************************************************
/=#
#include "VFR.uni"

//If customer define the common logical device by themselves, add here.
#string STR_AST2600_SIO_FORM                        #language eng "AST2600 Super IO Configuration"
#string STR_AST2600_SIO_FORM_HELP                   #language eng "System Super IO Chip Parameters."
#string STR_AST2600_SIO_PROMPT                      #language eng "Super IO Chip"
#string STR_AST2600                                 #language eng "AST2600"

//
//Serial 1/2/3/4 Settings
//

#string STR_AST2600_COMA_CHANGE_CONFIG              #language eng "Change Settings"
                                                    #language x-UEFI-AMI "YSIO000"
#string STR_AST2600_COMB_CHANGE_CONFIG              #language eng "Change Settings"
                                                    #language x-UEFI-AMI "YSIO001"
#string STR_AST2600_COMC_CHANGE_CONFIG              #language eng "Change Settings"
                                                    #language x-UEFI-AMI "YSIO002"
#string STR_AST2600_COMD_CHANGE_CONFIG              #language eng "Change Settings"
                                                    #language x-UEFI-AMI "YSIO003"
                                                    
//Below are possible resource setting for all serial port
#string STR_AST2600_SERIAL_IO3E8_IRQ7               #language eng "IO=3E8h; IRQ=7;"
#string STR_AST2600_SERIAL_IO2E8_IRQ7               #language eng "IO=2E8h; IRQ=7;"
#string STR_AST2600_SERIAL_IO220_IRQ7               #language eng "IO=220h; IRQ=7;"
#string STR_AST2600_SERIAL_IO228_IRQ7               #language eng "IO=228h; IRQ=7;"
#string STR_AST2600_SERIAL_IO3E8_IRQX               #language eng "IO=3E8h; IRQ=3,4,5,6,7,9,10,11,12;"
#string STR_AST2600_SERIAL_IO2E8_IRQX               #language eng "IO=2E8h; IRQ=3,4,5,6,7,9,10,11,12;"
#string STR_AST2600_SERIAL_IO220_IRQX               #language eng "IO=220h; IRQ=3,4,5,6,7,9,10,11,12;"
#string STR_AST2600_SERIAL_IO228_IRQX               #language eng "IO=228h; IRQ=3,4,5,6,7,9,10,11,12;"

//
//Serial 1 settings when eSPI Interface
//
//Below are possible resource setting for com1 port
#string STR_AST2600_SERIAL1_IO3F8_IRQ4                   #language eng "IO=3F8h; IRQ=4;"
#string STR_AST2600_SERIAL1_IO2F8_IRQ4                   #language eng "IO=2F8h; IRQ=4;"
#string STR_AST2600_SERIAL1_IO3E8_IRQ4                   #language eng "IO=3E8h; IRQ=4;"
#string STR_AST2600_SERIAL1_IO2E8_IRQ4                   #language eng "IO=2E8h; IRQ=4;"

//
//Serial 2 settings when eSPI Interface
//
//Below are possible resource setting for com2 port
#string STR_AST2600_SERIAL2_IO3F8_IRQ3                   #language eng "IO=3F8h; IRQ=3;"
#string STR_AST2600_SERIAL2_IO2F8_IRQ3                   #language eng "IO=2F8h; IRQ=3;"
#string STR_AST2600_SERIAL2_IO3E8_IRQ3                   #language eng "IO=3E8h; IRQ=3;"
#string STR_AST2600_SERIAL2_IO2E8_IRQ3                   #language eng "IO=2E8h; IRQ=3;"
